{
  "dreams": {

  "Abandonment": "implies that you need more support and security in your life.  Nobody is paying enough attention to you and you feel left out in a certain situation.  Majority of people who dream of being abandoned have lost somebody close to them in life or a relationship.  If you have a recourring dream of being abandoned means that you have trouble in your past as a child.  You might want to find the root of the problem in order for the dream to stop.  If you are the one who is abandoning means that you are fleeing from your responsibilities and need to grow up and face the problem head on.  You have trouble making important decisions in your life."
  
  "Abbey": "When we come across an Abbey in our dreams suggest that we are looking to find 
          inner peace and to clean up old habits."

  "Abdomen": "represents your gut feeling on a situation.  This is a interesting dream symbol because it represents your intuitive human instincts in your walking life.  There is someone or something you cant seem to stomach."

  "Abduction": "People who dream about being abducted wake up feeling like they had a horrible nightmare.  These types of dreams mean that somebody close to you in your life is controlling your every move.  You need to be more assertive in life and try and not be run over."

  "Abnormal": "To feel or notice something abnormal even in a dream suggest that you will over come an issue that has been bothering you for a long time.  Its possible that somebody may have newly entered your life and you don’t feel comfortable around them."

  "Aborigine": "To see anybody who is Aborigine or from a native tribe represents the spiritual side of you.  You may relate to this character and want more inner peace.  You may be too involved with yourself and need to come back down to earth."

  "Abortion": "If you dream of having an abortion means that you are self destructing yourself from moving forward in life.  You want the easy escape out in life.  If you witness an abortion means that your “Aborting” from some plan or activity that you are running away from."

  "Above": "When we notice objects above us in dreams signifies your goals.  You might feel that your goals are a bit out of reach at the moment.  You need to take baby steps in order to get to the top.  If you remember what symbols where at the top will help you understand what you need to get.  Its possible that you might feel insecure and you think people are above you in life."

  "Abroad": "When we dream of being abroad means that there is problem in your life that your not tackling.  You are escaping your tasks."

  "Abcess": "When we dream of abscess means that you need to get something out that’s bothering you.  If you drain an abscess in your dreams suggest you will be feeling drained in the future."
  "Absent": "If you dream of being absent means that you should be more involved with your surroundings.  If you dream that somebody else is absent means that you feel a need to see them."

  "Abstinence": "When we dream of being “Abstinent” in our dreams means that you are restricting yourself from the daily pleasures in your life.  Its possible that you have a very strong mind and you are experiencing a sexual set back."

  "Abundance": "When we dream of a mass abundance of items in our dreams suggests that you need to stop being so selfish.  If you remember what you where holding on to in your dream  may help you understand what you need to let go in your life."

  "Abuse": "Depending the context of the dream can mean two different things.  If you are being beaten up means that somebody is taking full control in your life.  If you where actually abused in your life and dream about being abused means that you are still affected by this traumatic event. If your past is still haunting you, you may want to seek help with a professional psychiatrist."

  "Accident": "an Accident in your dream is quite an important dream symbol.  You must pay very close attention to this and remember as much as possible.  Usually when we dream about accidents we are involved in it.  Being in an accident means  you have lots of pent up anger over an on going issue that you haven’t resolved in your life. If you are on a bike and you crash it represents a sexual setback"

  "Accomplice": "Being an accomplice implies that somebody in your life is bringing you down mentally.  Nobody wants to be around a person whos going to get you in trouble.  You may want to find out who is the cause of this and try your best to move away. If you take somebody along with you as an accomplice means you are the one that is a negative around that person.  You may want to change your attitude."

  "Accountant": "If you dream of an accountant, it means your life is boring and you are boring and no one wants to be your friend."

  "Guilt": "You know what you did...."
  }
}



